zjcszn/mcu-demo/0. zjcszn/st/stm32f4/User/Library/stm32_usb_host/Core/Src/usbh_core.c
/**
  ******************************************************************************
  * @file    usbh_core.c
  * @author  MCD Application Team
  * @brief   This file implements the functions for the core state machine process
  *          the enumeration and the control transfer process
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#define LOG_TAG "USBH"
/* Includes ------------------------------------------------------------------*/
#include "usbh_core.h"
#include "portmacro.h"
#include <stdint.h>


/** @addtogroup USBH_LIB
  * @{
  */

/** @addtogroup USBH_LIB_CORE
  * @{
  */

/** @defgroup USBH_CORE
  * @brief This file handles the basic enumeration when a device is connected
  *          to the host.
  * @{
  */


/** @defgroup USBH_CORE_Private_Defines
  * @{
  */
#define USBH_ADDRESS_DEFAULT                     0x00U
#define USBH_ADDRESS_ASSIGNED                    0x01U
#define USBH_MPS_DEFAULT                         0x40U
/**
  * @}
  */

/** @defgroup USBH_CORE_Private_Macros
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_CORE_Private_Variables
  * @{
  */
#if (USBH_USE_OS == 1U)
#if (osCMSIS >= 0x20000U)
osThreadAttr_t USBH_Thread_Atrr;
#endif
#endif


/**
  * @}
  */


/** @defgroup USBH_CORE_Private_Functions
  * @{
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost);
static void USBH_HandleSof(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef DeInitStateMachine(USBH_HandleTypeDef *phost);

#if (USBH_USE_OS == 1U)
static void USBH_Process_OS(void *argument);
#endif

/**
  * @brief  HCD_Init
  *         Initialize the HOST Core.
  * @param  phost: Host Handle
  * @param  pUsrFunc: User Callback
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Init(USBH_HandleTypeDef *phost,
                             void (*pUsrFunc)(USBH_HandleTypeDef *phost,
                                              uint8_t id), uint8_t id) {
    /* Check whether the USB Host handle is valid */
    if (phost == NULL) {
        USBH_ErrLog("Invalid Host handle");
        return USBH_FAIL;
    }
    
    /* Set DRiver ID */
    phost->id = id;
    
    /* Unlink class*/
    phost->pActiveClass = NULL;
    phost->ClassNumber = 0U;
    
    /* Restore default states and prepare EP0 */
    (void)DeInitStateMachine(phost);
    
    /* Restore default Device connection states */
    phost->device.PortEnabled = 0U;
    phost->device.is_connected = 0U;
    phost->device.is_disconnected = 0U;
    phost->device.is_ReEnumerated = 0U;
    
    /* Assign User process */
    if (pUsrFunc != NULL) {
        phost->pUser = pUsrFunc;
    }

#if (USBH_USE_OS == 1U)
    
    /* Create USB Host Queue */
    static uint8_t staticQueueStorageArea[MSGQUEUE_OBJECTS * sizeof(phost->os_msg)];
    static StaticQueue_t staticQueueStructure;
    phost->os_event = xQueueCreateStatic(MSGQUEUE_OBJECTS,
                                         sizeof(phost->os_msg),
                                         staticQueueStorageArea,
                                         &staticQueueStructure);
    
    /* Create USB Host Task */
    xTaskCreate(USBH_Process_OS,
                "usb host task",
                USBH_PROCESS_STACK_SIZE / sizeof(StackType_t),
                phost,
                USBH_PROCESS_PRIO,
                &(phost->thread));
    
    configASSERT(phost->thread != NULL);
#endif /* (USBH_USE_OS == 1U) */
    
    /* Initialize low level driver */
    (void)USBH_LL_Init(phost);
    
    return USBH_OK;
}

/**
  * @brief  HCD_Init
  *         De-Initialize the Host portion of the driver.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_DeInit(USBH_HandleTypeDef *phost) {
    (void)DeInitStateMachine(phost);
    
    /* Restore default Device connection states */
    phost->device.PortEnabled = 0U;
    phost->device.is_connected = 0U;
    phost->device.is_disconnected = 0U;
    phost->device.is_ReEnumerated = 0U;
    phost->device.RstCnt = 0U;
    phost->device.EnumCnt = 0U;
    
    if (phost->pData != NULL) {
        (void)USBH_LL_Stop(phost);
    }

#if (USBH_USE_OS == 1U)
    
    /* Free allocated resource for USBH process */
    vTaskDelete(phost->thread);
    vQueueDelete(phost->os_event);

#endif /* (USBH_USE_OS == 1U) */
    
    return USBH_OK;
}

/**
  * @brief  DeInitStateMachine
  *         De-Initialize the Host state machine.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef DeInitStateMachine(USBH_HandleTypeDef *phost) {
    uint32_t i = 0U;
    
    /* Clear Pipes flags*/
    for (i = 0U; i < USBH_MAX_PIPES_NBR; i++) {
        phost->Pipes[i] = 0U;
    }
    
    for (i = 0U; i < USBH_MAX_DATA_BUFFER; i++) {
        phost->device.Data[i] = 0U;
    }
    
    phost->gState = HOST_IDLE;
    phost->EnumState = ENUM_IDLE;
    phost->RequestState = CMD_SEND;
    phost->Timer = 0U;
    
    phost->Control.state = CTRL_SETUP;
    phost->Control.pipe_size = USBH_MPS_DEFAULT;
    phost->Control.errorcount = 0U;
    
    phost->device.address = USBH_ADDRESS_DEFAULT;
    phost->device.speed = (uint8_t)USBH_SPEED_FULL;
    phost->device.RstCnt = 0U;
    phost->device.EnumCnt = 0U;
    
    /* Reset the device struct */
    USBH_memset(&phost->device.CfgDesc_Raw, 0, sizeof(phost->device.CfgDesc_Raw));
    USBH_memset(&phost->device.Data, 0, sizeof(phost->device.Data));
    USBH_memset(&phost->device.DevDesc, 0, sizeof(phost->device.DevDesc));
    USBH_memset(&phost->device.CfgDesc, 0, sizeof(phost->device.CfgDesc));
    
    return USBH_OK;
}

/**
  * @brief  USBH_RegisterClass
  *         Link class driver to Host Core.
  * @param  phost : Host Handle
  * @param  pclass: Class handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_RegisterClass(USBH_HandleTypeDef *phost, USBH_ClassTypeDef *pclass) {
    USBH_StatusTypeDef status = USBH_OK;
    
