zjcszn/mcu-demo/0. zjcszn/st/stm32f4/User/Library/stm32_usb_host/Core/Src/usbh_core.c
    if (pclass != NULL) {
        if (phost->ClassNumber < USBH_MAX_NUM_SUPPORTED_CLASS) {
            /* link the class to the USB Host handle */
            phost->pClass[phost->ClassNumber++] = pclass;
            status = USBH_OK;
        } else {
            USBH_ErrLog("Max Class Number reached");
            status = USBH_FAIL;
        }
    } else {
        USBH_ErrLog("Invalid Class handle");
        status = USBH_FAIL;
    }
    
    return status;
}

/**
  * @brief  USBH_SelectInterface
  *         Select current interface.
  * @param  phost: Host Handle
  * @param  interface: Interface number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_SelectInterface(USBH_HandleTypeDef *phost, uint8_t interface) {
    USBH_StatusTypeDef status = USBH_OK;
    
    if (interface < phost->device.CfgDesc.bNumInterfaces) {
        phost->device.current_interface = interface;
        USBH_UsrLog("Switching to Interface (#%d)", interface);
        USBH_UsrLog("Class    : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceClass);
        USBH_UsrLog("SubClass : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceSubClass);
        USBH_UsrLog("Protocol : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceProtocol);
    } else {
        USBH_ErrLog("Cannot Select This Interface.");
        status = USBH_FAIL;
    }
    
    return status;
}

/**
  * @brief  USBH_GetActiveClass
  *         Return Device Class.
  * @param  phost: Host Handle
  * @param  interface: Interface index
  * @retval Class Code
  */
uint8_t USBH_GetActiveClass(USBH_HandleTypeDef *phost) {
    return (phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass);
}

/**
  * @brief  USBH_FindInterface
  *         Find the interface index for a specific class.
  * @param  phost: Host Handle
  * @param  Class: Class code
  * @param  SubClass: SubClass code
  * @param  Protocol: Protocol code
  * @retval interface index in the configuration structure
  * @note : (1)interface index 0xFF means interface index not found
  */
uint8_t USBH_FindInterface(USBH_HandleTypeDef *phost, uint8_t Class, uint8_t SubClass, uint8_t Protocol) {
    USBH_InterfaceDescTypeDef *pif;
    USBH_CfgDescTypeDef *pcfg;
    uint8_t if_ix = 0U;
    
    pif = (USBH_InterfaceDescTypeDef *)NULL;
    pcfg = &phost->device.CfgDesc;
    
    while (if_ix < USBH_MAX_NUM_INTERFACES) {
        pif = &pcfg->Itf_Desc[if_ix];
        if (((pif->bInterfaceClass == Class) || (Class == 0xFFU)) &&
            ((pif->bInterfaceSubClass == SubClass) || (SubClass == 0xFFU)) &&
            ((pif->bInterfaceProtocol == Protocol) || (Protocol == 0xFFU))) {
            return if_ix;
        }
        if_ix++;
    }
    return 0xFFU;
}

/**
  * @brief  USBH_FindInterfaceIndex
  *         Find the interface index for a specific class interface and alternate setting number.
  * @param  phost: Host Handle
  * @param  interface_number: interface number
  * @param  alt_settings    : alternate setting number
  * @retval interface index in the configuration structure
  * @note : (1)interface index 0xFF means interface index not found
  */
uint8_t USBH_FindInterfaceIndex(USBH_HandleTypeDef *phost, uint8_t interface_number, uint8_t alt_settings) {
    USBH_InterfaceDescTypeDef *pif;
    USBH_CfgDescTypeDef *pcfg;
    uint8_t if_ix = 0U;
    
    pif = (USBH_InterfaceDescTypeDef *)NULL;
    pcfg = &phost->device.CfgDesc;
    
    while (if_ix < USBH_MAX_NUM_INTERFACES) {
        pif = &pcfg->Itf_Desc[if_ix];
        if ((pif->bInterfaceNumber == interface_number) && (pif->bAlternateSetting == alt_settings)) {
            return if_ix;
        }
        if_ix++;
    }
    return 0xFFU;
}

/**
  * @brief  USBH_Start
  *         Start the USB Host Core.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Start(USBH_HandleTypeDef *phost) {
    /* Start the low level driver  */
    (void)USBH_LL_Start(phost);
    
    /* Activate VBUS on the port */
    (void)USBH_LL_DriverVBUS(phost, TRUE);
    
    return USBH_OK;
}

/**
  * @brief  USBH_Stop
  *         Stop the USB Host Core.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Stop(USBH_HandleTypeDef *phost) {
    /* DeActivate VBUS on the port */
    (void)USBH_LL_DriverVBUS(phost, FALSE);
    
    /* Stop and cleanup the low level driver  */
    (void)USBH_LL_Stop(phost);
    
    /* Free Control Pipes */
    (void)USBH_FreePipe(phost, phost->Control.pipe_in);
    (void)USBH_FreePipe(phost, phost->Control.pipe_out);
    
    return USBH_OK;
}

/**
  * @brief  HCD_ReEnumerate
  *         Perform a new Enumeration phase.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_ReEnumerate(USBH_HandleTypeDef *phost) {
    if (USBH_IsPortEnabled(phost) != 0U) {
        phost->device.is_ReEnumerated = 1U;
        
        /* Stop Host */
        (void)USBH_Stop(phost);
        
        phost->device.is_disconnected = 1U;
    }

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_PORT_EVENT;
    USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
    
    return USBH_OK;
}

/**
  * @brief  USBH_Process
  *         Background process of the USB Core.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Process(USBH_HandleTypeDef *phost) {
    __IO USBH_StatusTypeDef status = USBH_FAIL;
    uint8_t idx = 0U;
    
    /* check for Host pending port disconnect event */
    if (phost->device.is_disconnected == 1U) {
        phost->gState = HOST_DEV_DISCONNECTED;
    }
    
    switch (phost->gState) {
        case HOST_IDLE :
            
            if ((phost->device.is_connected) != 0U) {
                USBH_UsrLog("USB Device Connected");
                
                /* Wait for 200 ms after connection */
                phost->gState = HOST_DEV_WAIT_FOR_ATTACHMENT;
                USBH_Delay(200U);
                (void)USBH_LL_ResetPort(phost);
                
                /* Make sure to start with Default address */
                phost->device.address = USBH_ADDRESS_DEFAULT;
                phost->Timeout = 0U;

#if (USBH_USE_OS == 1U)
                phost->os_msg = (uint32_t)USBH_PORT_EVENT;
                USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            }
            break;
        
        case HOST_DEV_WAIT_FOR_ATTACHMENT: /* Wait for Port Enabled */
            
            if (phost->device.PortEnabled == 1U) {
                USBH_UsrLog("USB Device Reset Completed");
                phost->device.RstCnt = 0U;
                phost->gState = HOST_DEV_ATTACHED;
            } else {
                if (phost->Timeout > USBH_DEV_RESET_TIMEOUT) {
                    phost->device.RstCnt++;
                    if (phost->device.RstCnt > 3U) {
                        /* Buggy Device can't complete reset */
                        USBH_UsrLog("USB Reset Failed, Please unplug the Device.");
                        phost->gState = HOST_ABORT_STATE;
                    } else {
                        phost->gState = HOST_IDLE;
                    }
                } else {
                    phost->Timeout += 10U;
                    USBH_Delay(10U);
                }
            }
#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_PORT_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
        case HOST_DEV_ATTACHED :
            
            if (phost->pUser != NULL) {
                phost->pUser(phost, HOST_USER_CONNECTION);
            }
            
