zjcszn/mcu-demo/0. zjcszn/st/stm32f4/User/Library/stm32_usb_host/Core/Src/usbh_core.c
            /* Wait for 100 ms after Reset */
            USBH_Delay(100U);
            
            phost->device.speed = (uint8_t)USBH_LL_GetSpeed(phost);
            
            phost->gState = HOST_ENUMERATION;
            
            phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
            phost->Control.pipe_in = USBH_AllocPipe(phost, 0x80U);
            
            /* Open Control pipes */
            (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
                                phost->device.address, phost->device.speed,
                                USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);
            
            /* Open Control pipes */
            (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
                                phost->device.address, phost->device.speed,
                                USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_PORT_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
        case HOST_ENUMERATION:
            /* Check for enumeration status */
            status = USBH_HandleEnum(phost);
            if (status == USBH_OK) {
                /* The function shall return USBH_OK when full enumeration is complete */
                USBH_UsrLog("Enumeration done.");
                
                phost->device.current_interface = 0U;
                
                if (phost->device.DevDesc.bNumConfigurations == 1U) {
                    USBH_UsrLog("This device has only 1 configuration.");
                    phost->gState = HOST_SET_CONFIGURATION;
                } else {
                    phost->gState = HOST_INPUT;
                }
#if (USBH_USE_OS == 1U)
                phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
                USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            }
            break;
        
        case HOST_INPUT: {
            /* user callback for end of device basic enumeration */
            if (phost->pUser != NULL) {
                phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
                phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
                phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
                USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            }
        }
            break;
        
        case HOST_SET_CONFIGURATION:
            /* set configuration */
            if (USBH_SetCfg(phost, (uint16_t)phost->device.CfgDesc.bConfigurationValue) == USBH_OK) {
                phost->gState = HOST_SET_WAKEUP_FEATURE;
                USBH_UsrLog("Default configuration set.");
            }

#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_PORT_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
        case HOST_SET_WAKEUP_FEATURE:
            
            if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U) {
                status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);
                
                if (status == USBH_OK) {
                    USBH_UsrLog("Device remote wakeup enabled");
                    phost->gState = HOST_CHECK_CLASS;
                } else if (status == USBH_NOT_SUPPORTED) {
                    USBH_UsrLog("Remote wakeup not supported by the device");
                    phost->gState = HOST_CHECK_CLASS;
                } else {
                    /* .. */
                }
            } else {
                phost->gState = HOST_CHECK_CLASS;
            }

#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_PORT_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
        case HOST_CHECK_CLASS:
            
            if (phost->ClassNumber == 0U) {
                USBH_UsrLog("No Class has been registered.");
            } else {
                phost->pActiveClass = NULL;
                
                for (idx = 0U; idx < USBH_MAX_NUM_SUPPORTED_CLASS; idx++) {
                    if (phost->pClass[idx]->ClassCode == phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass) {
                        phost->pActiveClass = phost->pClass[idx];
                        break;
                    }
                }
                
                if (phost->pActiveClass != NULL) {
                    if (phost->pActiveClass->Init(phost) == USBH_OK) {
                        phost->gState = HOST_CLASS_REQUEST;
                        USBH_UsrLog("%s class started.", phost->pActiveClass->Name);
                        
                        /* Inform user that a class has been activated */
                        phost->pUser(phost, HOST_USER_CLASS_SELECTED);
                    } else {
                        phost->gState = HOST_ABORT_STATE;
                        USBH_UsrLog("Device not supporting %s class.", phost->pActiveClass->Name);
                    }
                } else {
                    phost->gState = HOST_ABORT_STATE;
                    USBH_UsrLog("No registered class for this device.");
                }
            }

#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
        case HOST_CLASS_REQUEST:
            /* process class standard control requests state machine */
            if (phost->pActiveClass != NULL) {
                status = phost->pActiveClass->Requests(phost);
                
                if (status == USBH_OK) {
                    phost->gState = HOST_CLASS;
                } else if (status == USBH_FAIL) {
                    phost->gState = HOST_ABORT_STATE;
                    USBH_ErrLog("Device not responding Please Unplug.");
                } else {
                    /* .. */
                }
            } else {
                phost->gState = HOST_ABORT_STATE;
                USBH_ErrLog("Invalid Class Driver.");
            }
#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
