zjcszn/mcu-demo/0. zjcszn/st/stm32f4/User/Library/stm32_usb_host/Core/Src/usbh_core.c
        case HOST_CLASS:
            /* process class state machine */
            if (phost->pActiveClass != NULL) {
                phost->pActiveClass->BgndProcess(phost);
            }
            break;
        
        case HOST_DEV_DISCONNECTED :
            phost->device.is_disconnected = 0U;
            
            (void)DeInitStateMachine(phost);
            
            /* Re-Initilaize Host for new Enumeration */
            if (phost->pActiveClass != NULL) {
                phost->pActiveClass->DeInit(phost);
                phost->pActiveClass = NULL;
            }
            
            if (phost->pUser != NULL) {
                phost->pUser(phost, HOST_USER_DISCONNECTION);
            }
            USBH_UsrLog("USB Device disconnected");
            
            if (phost->device.is_ReEnumerated == 1U) {
                phost->device.is_ReEnumerated = 0U;
                
                /* Start the host and re-enable Vbus */
                (void)USBH_Start(phost);
            } else {
                /* Device Disconnection Completed, start USB Driver */
                (void)USBH_LL_Start(phost);
            }

#if (USBH_USE_OS == 1U)
            phost->os_msg = (uint32_t)USBH_PORT_EVENT;
            USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
            break;
        
        case HOST_ABORT_STATE:
        default :
            break;
    }
    return USBH_OK;
}

/**
  * @brief  USBH_HandleEnum
  *         This function includes the complete enumeration process
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost) {
    USBH_StatusTypeDef Status = USBH_BUSY;
    USBH_StatusTypeDef ReqStatus = USBH_BUSY;
    
    switch (phost->EnumState) {
        case ENUM_IDLE:
            /* Get Device Desc for only 1st 8 bytes : To get EP0 MaxPacketSize */
            ReqStatus = USBH_Get_DevDesc(phost, 8U);
            if (ReqStatus == USBH_OK) {
                phost->Control.pipe_size = phost->device.DevDesc.bMaxPacketSize;
                
                phost->EnumState = ENUM_GET_FULL_DEV_DESC;
                
                /* modify control channels configuration for MaxPacket size */
                (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U, phost->device.address,
                                    phost->device.speed, USBH_EP_CONTROL,
                                    (uint16_t)phost->Control.pipe_size);
                
                /* Open Control pipes */
                (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U, phost->device.address,
                                    phost->device.speed, USBH_EP_CONTROL,
                                    (uint16_t)phost->Control.pipe_size);
            } else if (ReqStatus == USBH_NOT_SUPPORTED) {
                USBH_ErrLog("Control error: Get Device Descriptor request failed");
                phost->device.EnumCnt++;
                if (phost->device.EnumCnt > 3U) {
                    /* Buggy Device can't complete get device desc request */
                    USBH_UsrLog("Control error, Device not Responding Please unplug the Device.");
                    phost->gState = HOST_ABORT_STATE;
                } else {
                    /* free control pipes */
                    (void)USBH_FreePipe(phost, phost->Control.pipe_out);
                    (void)USBH_FreePipe(phost, phost->Control.pipe_in);
                    
                    /* Reset the USB Device */
                    phost->gState = HOST_IDLE;
                }
            } else {
                /* .. */
            }
            break;
        
        case ENUM_GET_FULL_DEV_DESC:
            /* Get FULL Device Desc  */
            ReqStatus = USBH_Get_DevDesc(phost, USB_DEVICE_DESC_SIZE);
            if (ReqStatus == USBH_OK) {
                USBH_UsrLog("PID: %xh", phost->device.DevDesc.idProduct);
                USBH_UsrLog("VID: %xh", phost->device.DevDesc.idVendor);
                
                phost->EnumState = ENUM_SET_ADDR;
            } else if (ReqStatus == USBH_NOT_SUPPORTED) {
                USBH_ErrLog("Control error: Get Full Device Descriptor request failed");
                phost->device.EnumCnt++;
                if (phost->device.EnumCnt > 3U) {
                    /* Buggy Device can't complete get device desc request */
                    USBH_UsrLog("Control error, Device not Responding Please unplug the Device.");
                    phost->gState = HOST_ABORT_STATE;
                } else {
                    /* Free control pipes */
                    (void)USBH_FreePipe(phost, phost->Control.pipe_out);
                    (void)USBH_FreePipe(phost, phost->Control.pipe_in);
                    
                    /* Reset the USB Device */
                    phost->EnumState = ENUM_IDLE;
                    phost->gState = HOST_IDLE;
                }
            } else {
                /* .. */
            }
            break;
        
        case ENUM_SET_ADDR:
            /* set address */
            ReqStatus = USBH_SetAddress(phost, USBH_DEVICE_ADDRESS);
            if (ReqStatus == USBH_OK) {
                USBH_Delay(2U);
                phost->device.address = USBH_DEVICE_ADDRESS;
                
                /* user callback for device address assigned */
                USBH_UsrLog("Address (#%d) assigned.", phost->device.address);
                phost->EnumState = ENUM_GET_CFG_DESC;
                
                /* modify control channels to update device address */
                (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U, phost->device.address,
                                    phost->device.speed, USBH_EP_CONTROL,
                                    (uint16_t)phost->Control.pipe_size);
                
                /* Open Control pipes */
                (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U, phost->device.address,
                                    phost->device.speed, USBH_EP_CONTROL,
                                    (uint16_t)phost->Control.pipe_size);
            } else if (ReqStatus == USBH_NOT_SUPPORTED) {
                USBH_ErrLog("Control error: Device Set Address request failed");
                
                /* Buggy Device can't complete get device desc request */
                USBH_UsrLog("Control error, Device not Responding Please unplug the Device.");
                phost->gState = HOST_ABORT_STATE;
                phost->EnumState = ENUM_IDLE;
            } else {
                /* .. */
            }
            break;
        
        case ENUM_GET_CFG_DESC:
            /* get standard configuration descriptor */
            ReqStatus = USBH_Get_CfgDesc(phost, USB_CONFIGURATION_DESC_SIZE);
            if (ReqStatus == USBH_OK) {
                phost->EnumState = ENUM_GET_FULL_CFG_DESC;
            } else if (ReqStatus == USBH_NOT_SUPPORTED) {
                USBH_ErrLog("Control error: Get Device configuration descriptor request failed");
                phost->device.EnumCnt++;
                if (phost->device.EnumCnt > 3U) {
                    /* Buggy Device can't complete get device desc request */
                    USBH_UsrLog("Control error, Device not Responding Please unplug the Device.");
                    phost->gState = HOST_ABORT_STATE;
                } else {
                    /* Free control pipes */
                    (void)USBH_FreePipe(phost, phost->Control.pipe_out);
                    (void)USBH_FreePipe(phost, phost->Control.pipe_in);
                    
                    /* Reset the USB Device */
                    phost->EnumState = ENUM_IDLE;
                    phost->gState = HOST_IDLE;
                }
            } else {
                /* .. */
            }
            break;
        
