zjcszn/mcu-demo/0. zjcszn/st/stm32f4/User/Library/stm32_usb_host/Core/Src/usbh_core.c
}

/**
  * @brief  USBH_LL_PortDisabled
  *         Port Disabled
  * @param  phost: Host Handle
  * @retval None
  */
void USBH_LL_PortDisabled(USBH_HandleTypeDef *phost) {
    phost->device.PortEnabled = 0U;
}

/**
  * @brief  HCD_IsPortEnabled
  *         Is Port Enabled
  * @param  phost: Host Handle
  * @retval None
  */
uint8_t USBH_IsPortEnabled(USBH_HandleTypeDef *phost) {
    return (phost->device.PortEnabled);
}

/**
  * @brief  USBH_LL_Connect
  *         Handle USB Host connection event
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
USBH_StatusTypeDef USBH_LL_Connect(USBH_HandleTypeDef *phost) {
    phost->device.is_connected = 1U;
    phost->device.is_disconnected = 0U;
    phost->device.is_ReEnumerated = 0U;

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_PORT_EVENT;
    USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
    
    return USBH_OK;
}

/**
  * @brief  USBH_LL_Disconnect
  *         Handle USB Host disconnection event
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
USBH_StatusTypeDef USBH_LL_Disconnect(USBH_HandleTypeDef *phost) {
    /* update device connection states */
    phost->device.is_disconnected = 1U;
    phost->device.is_connected = 0U;
    phost->device.PortEnabled = 0U;
    
    /* Stop Host */
    (void)USBH_LL_Stop(phost);
    
    /* FRee Control Pipes */
    (void)USBH_FreePipe(phost, phost->Control.pipe_in);
    (void)USBH_FreePipe(phost, phost->Control.pipe_out);
#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_PORT_EVENT;
    USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
#endif
    
    return USBH_OK;
}

#if (USBH_USE_OS == 1U)
/**
  * @brief  USB Host Thread task
  * @param  pvParameters not used
  * @retval None
  */


static void USBH_Process_OS(void *argument) {
    BaseType_t status;
    
    for (;;) {
        status = xQueueReceive(((USBH_HandleTypeDef *)argument)->os_event,
                               &(((USBH_HandleTypeDef *)argument)->os_msg), portMAX_DELAY);
        if (status == pdTRUE) {
            USBH_Process((USBH_HandleTypeDef *)argument);
        }
    }
}

/**
  * @brief  USBH_LL_NotifyURBChange
  *         Notify URB state Change
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_LL_NotifyURBChange(USBH_HandleTypeDef *phost) {
    phost->os_msg = (uint32_t)USBH_PORT_EVENT;
    
    USBH_POST_EVENT_MESSAGE(phost->os_event, &(phost->os_msg));
    
    return USBH_OK;
}
#endif
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

